# Brewfile
# ========
# - https://docs.brew.sh/Brew-Bundle-and-Brewfile
# - https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f


# Taps
# ====

# Homebrew
# --------
tap "homebrew/services"

# Others
# ------
# brew-cask-upgrade
# - https://github.com/buo/homebrew-cask-upgrade
tap "buo/cask-upgrade"


# Installs
# ========

# Shells
# ------

brew "bash"
brew 'bash-completion'
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"


brew "gh"
brew "git"
brew "gnupg"
brew "make"

# MAS-CLI
# - https://github.com/mas-cli/mas
brew "mas"

brew "node"

brew "enchant"
brew "graphviz"
brew "libmagic"
brew "python"
brew "python-tk"
brew "redis"
brew "tokei"
brew "tree"
brew "wget"

# Whalebrew
# - https://github.com/whalebrew/whalebrew
brew "whalebrew"


# Casks
# =====
# - https://formulae.brew.sh/cask/

# set arguments for all cask commands
cask_args appdir: "/Applications", require_sha: false


# Software Engineering
# --------------------

# Docker Desktop
# - https://formulae.brew.sh/cask/docker
cask "docker"

# GitHub Desktop
# - https://formulae.brew.sh/cask/github
cask "github"

# JupyterLab Desktop
# - https://formulae.brew.sh/cask/jupyterlab
cask "jupyterlab"

# Miniforge
# - https://formulae.brew.sh/cask/miniforge
cask "miniforge", postinstall: "${HOMEBREW_PREFIX}/bin/conda init --all -vv"

# VSCode
# - https://formulae.brew.sh/cask/visual-studio-code
cask "visual-studio-code"


# Terminals
# ---------

# iTerm2
# - https://formulae.brew.sh/cask/iterm2
cask "iterm2"


# Writing
# -------

# MacTeX
# - https://formulae.brew.sh/cask/mactex
cask "mactex"


# Graphics
# --------

# GIMP
# - https://formulae.brew.sh/cask/gimp
cask "gimp"


# Browsers
# --------

# Brave
# - https://formulae.brew.sh/cask/brave-browser
cask "brave-browser"

# Chrome
# - https://formulae.brew.sh/cask/google-chrome
cask "google-chrome"

# Tor
# - https://formulae.brew.sh/cask/tor-browser
cask "tor-browser"


# Password Managers
# -----------------

# LastPass
# - https://formulae.brew.sh/cask/lastpass
cask "lastpass"


# Communication
# -------------

# Discord
# - https://formulae.brew.sh/cask/discord
cask "discord"

# Microsoft Teams
# - https://formulae.brew.sh/cask/microsoft-teams
cask "microsoft-teams"

# Telegram
# - https://formulae.brew.sh/cask/telegram
cask "telegram"

# Webex
# - https://formulae.brew.sh/cask/webex
cask "webex"

# Whatsapp
# - https://formulae.brew.sh/cask/whatsapp
cask "whatsapp"

# Zoom
# - https://formulae.brew.sh/cask/zoom
cask "zoom"


# Streaming Services
# ------------------

# Amazon Music
# - https://formulae.brew.sh/cask/amazon-music
cask "amazon-music"

# Spotify
# - https://formulae.brew.sh/cask/spotify
cask "spotify"


# Multimedia
# ----------

# OBS
# - https://formulae.brew.sh/cask/obs
cask "obs"

# VLC Media Player
# - https://formulae.brew.sh/cask/vlc
cask "vlc"


# Remote Access
# -------------

# AnyDesk
# - https://formulae.brew.sh/cask/anydesk
cask "anydesk"

# OneDrive
# - https://formulae.brew.sh/cask/onedrive
cask "onedrive"

# TeamViewer
# - https://formulae.brew.sh/cask/teamviewer
cask "teamviewer"


# Utilities
# ---------

# Bluesnooze
# - https://formulae.brew.sh/cask/bluesnooze
cask "bluesnooze"

# Android File Transfer
# - https://formulae.brew.sh/cask/android-file-transfer
cask "android-file-transfer"

# Mathpix Snipping Tool
# - https://formulae.brew.sh/cask/mathpix-snipping-tool
cask "mathpix-snipping-tool"


# Fonts
# -----

# JetBrains Mono
# - https://www.jetbrains.com/lp/mono/
# - https://formulae.brew.sh/cask/font-jetbrains-mono
cask "font-jetbrains-mono"


# VSCode Extensions
# =================

vscode "anan.jetbrains-darcula-theme"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql-syntax"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "shinotatwu-ds.file-tree-generator"
vscode "waderyan.gitblame"
